const tableHeadRowTitles = {
  history: [
    'Дата',
    'Подія',
    "Ім'я користувача",
    'Роль користувача',
    "Об'єкт дії",
    'Деталі'
  ],
  historyDetails: ['Перед змінами', 'Після змін'],
  mainPageOrders: ['Дата', 'Вартість товару', 'Номер замовлення'],
  news: ['Аватар', 'Автор', 'Заголовок', 'Дії'],
  categories: ['Зображення', 'Категорія', 'Дії'],
  patterns: ['Фото', 'Назва', 'Код матеріалу', 'Доступний', 'Дії'],
  businessPages: ['№', 'Код', 'Заголовок', 'Дії'],
  materials: ['Назва', 'Застосування', 'Колір', 'Доступний', 'Дії'],
  materialColors: ['Фото', 'Повна назва', 'Коротка назва', 'Доступний', 'Дії'],
  products: [
    'Фото',
    'Назва',
    'Категорія',
    'Модель',
    'Гобелен',
    'Ціна(грн)',
    'Рейтинг',
    'Кількість покупок',
    'Дії'
  ],
  categoryName: ['№', 'Мова', 'Назва', 'Дії'],
  categoryImages: ['№', 'Розмір', 'Посилання', 'Дії'],
  users: {
    userTab: [
      'Аватар',
      "Ім'я",
      'Мобільний номер',
      'Пошта',
      'Роль',
      'Статус',
      'Дії'
    ],
    adminTab: ['Аватар', "Ім'я", 'Пошта', 'Роль', 'Дії']
  },
  contacts: ['Номер телефону', 'Email', 'Адреса', 'Дії'],
  orderProductTitles: ['№', 'Назва', 'Кількість', 'Ціна', 'Деталі'],
  comments: {
    commentPageTitles: ['Дата', 'Пошта', 'Текст', 'Видимий', 'Дії'],
    userPageTitles: ['Дата', 'Текст', 'Дії']
  },
  emailQuestions: ['Дата', 'Користувач', 'Email', 'Q/A', 'Статус', 'Видалити'],
  sizes: {
    sizesPageTitles: ['Назва', 'Розмір', 'Доступно', 'Дії']
  },
  models: ['Фото', 'Назва', 'Категорія', 'Доступна', 'Пріорітет', 'Дії'],
  headers: ['Назва', 'Пріорітет', 'Посилання', 'Дії'],
  orders: [
    'Дата',
    'Номер замовлення',
    'Отримувач',
    'Вартість товару',
    'Статус оплати',
    'Статус замовлення',
    'Дії'
  ],
  homePageSlides: ['Порядок', 'Назва', 'Доступний', 'Дії'],
  actionLabel: 'Дії',
  constructor: ['Колір', 'Назва', 'Матеріал', 'Доступний', 'Дії']
};

export default tableHeadRowTitles;
