const tableHeadRowTitles = {
  news: ['Аватар', 'Автор', 'Заголовок', 'Дії'],
  patterns: ['Фото', 'Назва', 'Код матеріалу', 'Доступний', 'Дії'],
  businessPages: ['Аватар', 'Код', 'Заголовок', 'Дії'],
  products: [
    'Фото',
    'Назва',
    'Категорія',
    'Модель',
    'Гобелен',
    'Ціна(грн)',
    'Рейтинг',
    'Кількість покупок',
    'Дії'
  ],
  categories: ['№', 'Категорія', 'Дії'],
  subcategories: ['№', 'Підкатегорія', 'Доступна', 'Дії'],
  categoryName: ['№', 'Мова', 'Назва', 'Дії'],
  categoryImages: ['№', 'Розмір', 'Посилання', 'Дії'],
  users: [
    'Аватар',
    "Ім'я",
    'Мобільний номер',
    'Пошта',
    'Роль',
    'Статус',
    'Дії'
  ],
  contacts: ['Номер телефону', 'Email', 'Адреса', 'Дії'],
  comments: ['Дата', 'Текст', 'Дії']
};
export default tableHeadRowTitles;
