const tableHeadRowTitles = {
  news: ['Аватар', 'Автор', 'Заголовок', 'Дії'],
  categories: ['Зображення', 'Категорія', 'Дії'],
  subcategories: ['Зображення', 'Підкатегорія', 'Доступна', 'Дії'],
  patterns: ['Фото', 'Назва', 'Код матеріалу', 'Доступний', 'Дії'],
  businessPages: ['Аватар', 'Код', 'Заголовок', 'Дії'],
  products: [
    'Фото',
    'Назва',
    'Категорія',
    'Модель',
    'Гобелен',
    'Ціна(грн)',
    'Рейтинг',
    'Кількість покупок',
    'Дії'
  ],
  categoryName: ['№', 'Мова', 'Назва', 'Дії'],
  categoryImages: ['№', 'Розмір', 'Посилання', 'Дії'],
  users: {
    userTab: [
      'Аватар',
      "Ім'я",
      'Мобільний номер',
      'Пошта',
      'Роль',
      'Статус',
      'Дії'
    ],
    adminTab: ['Аватар', "Ім'я", 'Пошта', 'Роль', 'Дії']
  },
  contacts: ['Номер телефону', 'Email', 'Адреса', 'Дії'],
  //  comments: ['Дата', 'Користувач', 'Текст', 'Дії'],
  comments: ['Дата', 'Текст', 'Дії'],
  emailQuestions: ['#', 'Користувач', 'Email', 'Q/A', 'Дата', 'Статус', 'Дії'],
  models: ['Фото', 'Назва', 'Категорія', 'Доступна', 'Пріорітет']
};
export default tableHeadRowTitles;
